IDEA StatiCa Open Model
SurfaceCharacteristicTypeSIA Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Surface characteristic
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum SurfaceCharacteristicTypeSIA
Public Enumeration SurfaceCharacteristicTypeSIA
public enum class SurfaceCharacteristicTypeSIA
Members
Member name | Value | Description
Plain | 0 |  Plain
Indented | 1 |  Indented
Ribbed | 2 |  Ribbed
See Also
Reference
IdeaRS.OpenModel.Material Namespace